app/controllers/posts_controller.rb

  def create
    params[:username] = @current_user.username
    params_received = post_params
    if params_received
      @post = Post.create(post_params)
---
INSERT INTO `posts` (`created_at`, `updated_at`, `image_file_name`, `image_content_type`, `image_file_size`, `image_updated_at`, `username`) VALUES ('2017-09-24 09:53:47', '2017-09-24 09:53:47', 'Selection_002.png', 'image/png', 136780, '2017-09-24 09:53:47', 'mangat')

  def index
    # shows all the posts created by a particular user.
    @post_create = Post.new
    @post_create.add_username(@current_user.username)
    @post_show = Post.where(:username => @current_user.username)
---
SELECT  `posts`.* FROM `posts` WHERE `posts`.`username` = 'mangat' LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`username` = 'Rhythm' LIMIT 1