app/controllers/user_controller.rb

  def create
    params_received = user_params
    params_received[:password_confirmation] = params[:password_confirmation]
    p params_received
    @user = User.new(params_received)
    p @user.password
     if @user.save
---
INSERT INTO `users` (`username`, `email`, `password`, `salt`, `created_at`, `updated_at`) VALUES ('pool', 'poti@gmailc.om', '$2a$10$HKECzisvsDk3jYkQWj2P.umPLLLUhaz45YjOQjPCrtwQHuHnlglcS', '$2a$10$HKECzisvsDk3jYkQWj2P.u', '2017-09-23 13:20:41', '2017-09-23 13:20:41')